win_x, win_y = 750, 550
win_width, win_height = 1000, 900

main_text = "     Викторина"
welcome_text = ("               Добро пожаловать в викторину! До того, как выбрать тему викторины,\n"
                "          просмотрите правила, нажав на соотвествущую кнопку справа снизу. Удачи!")
font1 = "Comic Sans MS"
main_font_size = 25
font_size = 10
btn_font_size = 10

rules_text = "Правила"
rules = ("Для начала выберите тему викторины в главном окне. После\n"
         "выбора вы должны будете ответить на 5-10 вопросов по этой теме.\n"
         "К каждому вопросу есть 4 варианта ответа. В поле ниже вопроса вы\n"
         "должны вписать номер правильного ответа.")


space_text = "Космос"

vic_topics = "Темы викторин:"

answer_txt = "Ответ"
answers_text = "Ответы"

menu_text = "Меню"

check_text = "Проверить"

check = "Вы прошли викторину. Ваши баллы: "
illation1 = "Отлично! Вы настоящий знаток!"
illation2 = "Неплохо. Но вам стоит учиться больше"
illation3 = "Видимо, вы очень плохи в этой области... Учитесь больше!"

'''Вопросы и ответы для Викторины: Космос'''
q1 = ("1) В зависимости от массы звезды жизнь ее может закончиться по-разному. А чем она закончиться не может?\n"
"1. Красным гигантом ; 2. Нейтронной звездой ; 3.Черной дырой ; 4. Белым карликом")
q2 = ("2) Эту галактику можно увидеть в северном полушарии невооруженным глазом?\n"
      "1. Туманность Андромеды ; 2. Темная материя ; 3.Туманность Стрельца ; 4.Млечный Путь")
q3 = ('3) Как с греческого переводится слово "космос" κόσμος?\n'
      "1. Звездa ; 2. Бесконечность ; 3. Мир ; 4. Пространство")
q4 = ("4) Кто предложил гелиоцентрическую систему строения солнечной системы?\n"
      "1. Николай Коперник ; 3. Галилео Галилей ; 2. Джордано Бруно ; 5. Альберт Энштейн")
q5 = ("5) Корабль, на котором полетел Юрий Гагарин назывался:\n"
      "1. Восход ; 2. Восток ; 3. Черная жемчужина ; 4.Вестник")
q6 = ("6) Первая открытая и описанная комета это:\n"
      "1. B-612 ; 2. Комета Энке ; 3. Комета Галлея ; 4. Комета Фая")
answer1 = '1'
answer2 = '1'
answer3 = '3'
answer4 = '1'
answer5 = '2'
answer6 = '3'

all_answers = ("1) В зависимости от массы звезды жизнь ее может закончиться по-разному. А чем она закончиться не может?\n"
               "       1. Красным гигантом\n"
               "2) Эту галактику можно увидеть в северном полушарии невооруженным глазом?\n"
               "       1. Туманность Андромеды\n"
               '3) Как с греческого переводится слово "космос" κόσμος?\n'
               "       3. Мир\n"
               "4) Кто предложил гелиоцентрическую систему строения солнечной системы?\n"
               "       1. Николай Коперник\n"
               "5) Корабль, на котором полетел Юрий Гагарин назывался:\n"
               "       2. Восток\n"
               "6) Первая открытая и описанная комета это:\n"
               "       3. Комета Галлея")

